<?php

$lang['required']			= "Поле %s обязательное.";
$lang['isset']				= "В поле %s должны быть данные.";
$lang['valid_email']		= "Поле %s должно содержать правильный адрес email.";
$lang['valid_emails']		= "В поле %s все email адреса должны быть правильными.";
$lang['valid_url']			= "Поле %s должно содержать правильный URL.";
$lang['valid_ip']			= "Поле %s должно содержать правильный IP.";
$lang['min_length']			= "Поле %s должно содержать не менее %s символов.";
$lang['max_length']			= "Поле %s должно содержать не более %s символов.";
$lang['exact_length']		= "Поле %s должно содержать ровно %s символов.";
$lang['alpha']				= "В поле %s могут быть только символы алфавита.";
$lang['alpha_numeric']		= "В поле %s могут быть только символы алфавита и цифры.";
$lang['alpha_dash']			= "В поле %s могут быть только символы алфавита, цифры, подчеркивание и тире.";
$lang['numeric']			= "В поле %s могут быть только числа.";
$lang['is_numeric']			= "В поле %s могут быть только цифры.";
$lang['integer']			= "В поле %s могет быть только целое число.";
$lang['regex_match']		= "В поле %s данные неправильного формата.";
$lang['matches']			= "Поле %s не совпадает с полем %s.";
$lang['is_unique'] 			= "Поле %s должно содержать уникальное значение.";
$lang['is_natural']			= "В поле %s должны быть только положительные числа.";
$lang['is_natural_no_zero']	= "В поле %s разрешены только числа больше нуля.";
$lang['decimal']			= "В поле %s должно быть десятичное число.";
$lang['less_than']			= "В поле %s должно быть число меньше чем %s.";
$lang['greater_than']		= "В поле %s должно быть число больше чем %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */